app/controllers/reviews_controller.rb

SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "reviews" SET "name" = ?, "updated_at" = ? WHERE "reviews"."id" = 7  [["name", "James"], ["updated_at", "2015-04-10 12:10:06.251305"]]
---
  def update
    @review = Review.find(params[:id])
    if @review.update(review_params)

SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 6]]
---
  def destroy
    @review = Review.find(params[:id])
    if @review.destroy